sergev/LiteBSD/sys/mips/pic32/trap.c
        case EJUSTRETURN:
            break;  /* nothing to do */

        default:
            locr0[V0] = i;
            locr0[A3] = 1;
        }
    done:
#ifdef KTRACE
        if (KTRPOINT(p, KTR_SYSRET))
            ktrsysret(p->p_tracep, code, i, rval[0]);
#endif
        goto out;
        }

    case T_BREAK+T_USER:
        {
        register unsigned va, instr;

        /* compute address of break instruction */
        va = pc;
        if ((int)causeReg < 0)
            va += 4;

        /* read break instruction */
        instr = fuiword((caddr_t)va);
#if 0
        printf("trap: %s (%d) breakpoint %x at %x: (adr %x ins %x)\n",
            p->p_comm, p->p_pid, instr, pc,
            p->p_md.md_ss_addr, p->p_md.md_ss_instr); /* XXX */
#endif
        if (p->p_md.md_ss_addr != va || instr != MACH_BREAK_SSTEP) {
            i = SIGTRAP;
            break;
        }

        /* restore original instruction and clear BP  */
        i = suiword((caddr_t)va, p->p_md.md_ss_instr);
        if (i < 0) {
            vm_offset_t sa, ea;
            int rv;

            sa = trunc_page((vm_offset_t)va);
            ea = round_page((vm_offset_t)va+sizeof(int)-1);
            rv = vm_map_protect(&p->p_vmspace->vm_map, sa, ea,
                VM_PROT_DEFAULT, FALSE);
            if (rv == KERN_SUCCESS) {
                i = suiword((caddr_t)va, p->p_md.md_ss_instr);
                (void) vm_map_protect(&p->p_vmspace->vm_map,
                    sa, ea, VM_PROT_READ|VM_PROT_EXECUTE,
                    FALSE);
            }
        }
        if (i < 0)
            printf("Warning: can't restore instruction at %x: %x\n",
                p->p_md.md_ss_addr, p->p_md.md_ss_instr);
        p->p_md.md_ss_addr = 0;
        i = SIGTRAP;
        break;
        }

    case T_RES_INST+T_USER:
        i = SIGILL;
        break;

    case T_COP_UNUSABLE+T_USER:
        i = SIGILL;
        break;

    case T_OVFLOW+T_USER:
        i = SIGFPE;
        break;

    case T_ADDR_ERR_LD:     /* misaligned access */
    case T_ADDR_ERR_ST:     /* misaligned access */
    case T_BUS_ERR_LD_ST:   /* BERR asserted to cpu */
        i = ((struct pcb *)UADDR)->pcb_onfault;
        if (i) {
            ((struct pcb *)UADDR)->pcb_onfault = 0;
            return (onfault_table[i]);
        }
        /* FALLTHROUGH */

    default:
    err:
        panic("trap");
    }
    trapsignal(p, i, ucode);
out:
    /*
     * Note: we should only get here if returning to user mode.
     */
    /* take pending signals */
    while ((i = CURSIG(p)) != 0)
        postsig(i);
    p->p_priority = p->p_usrpri;
    astpending = 0;
    if (want_resched) {
        int s;

        /*
         * Since we are curproc, clock will normally just change
         * our priority without moving us from one queue to another
         * (since the running process is not on a queue.)
         * If that happened after we put ourselves on the run queue
         * but before we switched, we might not be on the queue
         * indicated by our priority.
         */
        s = splstatclock();
        setrunqueue(p);
        p->p_stats->p_ru.ru_nivcsw++;
        mi_switch();
        splx(s);
        while ((i = CURSIG(p)) != 0)
            postsig(i);
    }

    /*
     * If profiling, charge system time to the trapped pc.
     */
    if (p->p_flag & P_PROFIL) {
        extern int psratio;

        addupc_task(p, pc, (int)(p->p_sticks - sticks) * psratio);
    }

    curpriority = p->p_priority;
    return (pc);
}

/*
 * Handle an interrupt.
 * Called from kern_interrupt() or user_interrupt()
 * Note: curproc might be NULL.
 */
interrupt(statusReg, pc)
    unsigned statusReg;     /* status register at time of the exception */
    unsigned pc;            /* program counter where to continue */
{
    struct clockframe cf;

    cnt.v_intr++;

    /* Get the current irq number */
    int intstat = INTSTAT;
    int irq = PIC32_INTSTAT_VEC (intstat);

    /* Handle the interrupt. */
    switch (irq) {
    case PIC32_IRQ_CT:                  /* Core Timer */
        /* Increment COMPARE register. */
        IFSCLR(0) = 1 << PIC32_IRQ_CT;
        int c = mfc0_Compare();
        c += (CPU_KHZ * 1000 / HZ + 1) / 2;
        mtc0_Compare (c);

        cf.pc = pc;
        cf.sr = statusReg;
        hardclock(&cf);
        break;

    case PIC32_IRQ_CS0:                 /* Core software interrupt 0 */
        clearsoftclock();
        cnt.v_soft++;
        softclock();
        break;

    case PIC32_IRQ_CS1:                 /* Core software interrupt 1 */
        clearsoftnet();
        cnt.v_soft++;
#ifdef INET
        if (netisr & (1 << NETISR_ARP)) {
            netisr &= ~(1 << NETISR_ARP);
            arpintr();
        }
        if (netisr & (1 << NETISR_IP)) {
            netisr &= ~(1 << NETISR_IP);
            ipintr();
        }
#endif
        break;

#ifdef UART1_ENABLED
    case PIC32_IRQ_U1E:                 /* UART1 */
    case PIC32_IRQ_U1RX:                /* UART1 */
    case PIC32_IRQ_U1TX:                /* UART1 */
        uartintr(makedev(UART_MAJOR,0));
        break;
#endif
    }
}

/*
 * This is called from user_interrupt() if astpending is set.
 * This is very similar to the tail of exception().
 */
softintr()
{
    register struct proc *p = curproc;
    int sig;

    cnt.v_soft++;

    /* take pending signals */
    while ((sig = CURSIG(p)) != 0)
        postsig(sig);
    p->p_priority = p->p_usrpri;
    astpending = 0;
    if (p->p_flag & P_OWEUPC) {
        p->p_flag &= ~P_OWEUPC;
        ADDUPROF(p);
    }
    if (want_resched) {
        int s;

        /*
         * Since we are curproc, clock will normally just change
         * our priority without moving us from one queue to another
         * (since the running process is not on a queue.)
         * If that happened after we put ourselves on the run queue
         * but before we switched, we might not be on the queue
         * indicated by our priority.
         */
        s = splstatclock();
        setrunqueue(p);
        p->p_stats->p_ru.ru_nivcsw++;
        mi_switch();
        splx(s);
        while ((sig = CURSIG(p)) != 0)
            postsig(sig);
    }
    curpriority = p->p_priority;
}

/*
 * This routine is called by procxmt() to single step one instruction.
 */
cpu_singlestep(p)
    register struct proc *p;
{
    // TODO: use Debug.SST bit.
    return (0);
}
